юв_гит_/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <registerRecords>AccumulationRegister.ПроизводствоИзделий</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеЗаказов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказанныеИзделия</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Производство</name>
      <type>
        <types>DocumentRef.Производство</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

юв_гит_/src/Documents/ЗаказКлиента/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗаказКлиента.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Состояние,
	|	ЗаказКлиента.ЗаказанныеИзделия.(
	|		НомерСтроки,
	|		Изделие,
	|		Спецификация,
	|		Количество,
	|		Цена,
	|		Сумма,
	|		Производство
	|	)
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаказанныеИзделияШапка = Макет.ПолучитьОбласть("ЗаказанныеИзделияШапка");
	ОбластьЗаказанныеИзделия = Макет.ПолучитьОбласть("ЗаказанныеИзделия");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьЗаказанныеИзделияШапка);
		ВыборкаЗаказанныеИзделия = Выборка.ЗаказанныеИзделия.Выбрать();
		Пока ВыборкаЗаказанныеИзделия.Следующий() Цикл
			ОбластьЗаказанныеИзделия.Параметры.Заполнить(ВыборкаЗаказанныеИзделия);
			ТабДок.Вывести(ОбластьЗаказанныеИзделия, ВыборкаЗаказанныеИзделия.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
